<script setup lang="ts">
useHead({
    title: '播客快剪',
    meta: [
        { name: 'description', content: '一个基于AI的播客编辑工具.' }
    ],
})
</script>
<template>
    <div class="app">
        <h1><img src="/images/podclipper.png" style="width:1em;height:1em;margin-right: 0.2em;" />播客快剪</h1>
        <div>
            <img class="cover" src="/images/podclipper.jpg" />
        </div>
        <div class="subtitle">
            播客快剪是一个快速编辑播客的工具，作者自己的播客“四十不惑”的每一期都是用这个工具剪的，编辑声音最大的一个痛点是无法通过波形直接看出来内容，所以这个工具最大的特点是会先通过AI手段进行语音识别，然后就可以像编辑word一样编辑声音了。还可以在文本中间插入段落注释，以便更条理的梳理播客内容，欢迎体验，欢迎留言。
        </div>
        <div class="qa">
            <h2>Q&A</h2>
            <div class="q">我的声音会发送到某个服务器上进行识别吗？</div>
            <div class="a">不会，你的声音将只会存储在你的电脑上，这个软件会直接使用本地的AI模型进行识别</div>
            <div class="q">为什么语音识别的结果不是很准确？</div>
            <div class="a">要实现更准确的识别，需要使用更快的CPU并且会占用更多的内存，鉴于播客编辑并不需要那么准确的识别结果，因此我选择了一个占用资源更少但是识别更快速的模型</div>
            <div class="q">我在使用过程中遇到问题应该怎样反馈？</div>
            <div class="a">可以直接在评论区留言或者给我发邮件: <a href="mailto:podclipper@wqiang.fun"> podclipper@wqiang.fun </a></div>
        </div>
        <div class="privacy">
            <h2>隐私条款</h2>
            <pre>
播客快剪（以下简称“本软件”）非常重视您的隐私权利。本软件将通过此隐私条款告知您我们如何收集、使用和保护您的个人信息。请您仔细阅读本隐私条款并确保您完全理解并同意其中的内容。

一、信息收集

在使用本软件时，我们会收集您的一些个人信息，包括但不限于：

在使用本软件的过程中，我们可能会采集一些技术信息，包括但不限于您的IP地址、设备标识符、设备型号、操作系统版本等技术信息。
二、信息使用

本软件仅会将您的个人信息用于以下用途：

为了向您提供更好的服务，我们会使用AI模型对您的音频文件进行语音识别。但是，所有的操作都将在本地进行，不会上传任何用户的内容；
我们可能会使用您的个人信息来改善本软件的功能和性能，以便为您提供更好的服务；
除非我们获得您的明确授权，否则我们不会将您的个人信息用于其他用途。
三、信息保护

本软件将采取合理的措施来保护您的个人信息安全，以防止未经授权的访问、使用、披露、修改或破坏。我们将采取以下安全措施：

我们仅允许需要访问您的个人信息来执行其工作职责的人访问您的个人信息；
我们采用加密技术来保护您的个人信息；
我们将定期审核我们的个人信息处理和安全措施。
四、信息披露

我们不会向任何第三方公开或出售您的个人信息，除非：

我们获得您的明确授权；
法律、法规、法院命令、政府机关要求我们公开您的个人信息；
我们认为这样做是必要的，以保护我们的合法权益、财产或安全，或保护公共安全。
五、未成年人隐私保护

我们非常重视未成年人的隐私保护。如果您是未成年人，请在您父母或监护人的指导下使用本软件。

六、隐私条款的修改

我们可能会不时修改本隐私条款的内容。如果我们做出任何重大修改，我们将在本软件上发布通知。如果您继续使用本软件，即表示您同意修改后的隐私条款。

七、联系我们

如果您有任何关于本隐私条款的疑问、意见或建议，请通过以下联系方式与我们联系：

邮箱地址：podclipper@wqiang.fun

感谢您使用本软件！
            </pre>
        </div>
    </div>
</template>
<style scoped>
.qa {
    padding: 2em 0;
    line-height: 200%;
}

.q {
    font-weight: bolder;
    font-size: medium;
    margin-top: 1em;
}

.a {
    color: #333;
}

pre {
    white-space: pre-wrap;
    word-wrap: break-spaces;
    color: #888;
}
</style>